load-testing/cluster.txt
Phase started: unnamed (index: 0, duration: 30s) 21:46:24(-0600)

--------------------------------------
Metrics for period to: 21:46:30(-0600) (width: 4s)
--------------------------------------

vusers.created_by_name.0: ...................................................... 5
vusers.created.total: .......................................................... 5
vusers.failed: ................................................................. 4
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 5
http.codes.200: ................................................................ 4
http.responses: ................................................................ 4
http.response_time:
  min: ......................................................................... 216
  max: ......................................................................... 235
  median: ...................................................................... 223.7
  p95: ......................................................................... 228.2
  p99: ......................................................................... 228.2


--------------------------------------
Metrics for period to: 21:46:40(-0600) (width: 9.774s)
--------------------------------------

vusers.failed: ................................................................. 10
vusers.created_by_name.0: ...................................................... 10
vusers.created.total: .......................................................... 10
http.request_rate: ............................................................. 1/sec
http.codes.200: ................................................................ 10
http.responses: ................................................................ 10
http.requests: ................................................................. 10
http.response_time:
  min: ......................................................................... 219
  max: ......................................................................... 235
  median: ...................................................................... 223.7
  p95: ......................................................................... 228.2
  p99: ......................................................................... 228.2


Phase completed: unnamed (index: 0, duration: 30s) 21:46:54(-0600)

--------------------------------------
Metrics for period to: 21:46:50(-0600) (width: 9.781s)
--------------------------------------

vusers.failed: ................................................................. 10
vusers.created_by_name.0: ...................................................... 10
vusers.created.total: .......................................................... 10
http.request_rate: ............................................................. 1/sec
http.codes.200: ................................................................ 10
http.responses: ................................................................ 10
http.requests: ................................................................. 10
http.response_time:
  min: ......................................................................... 222
  max: ......................................................................... 251
  median: ...................................................................... 237.5
  p95: ......................................................................... 252.2
  p99: ......................................................................... 252.2


--------------------------------------
Metrics for period to: 21:47:00(-0600) (width: 4.963s)
--------------------------------------

vusers.failed: ................................................................. 6
vusers.created_by_name.0: ...................................................... 5
vusers.created.total: .......................................................... 5
http.request_rate: ............................................................. 1/sec
http.codes.200: ................................................................ 6
http.responses: ................................................................ 6
http.requests: ................................................................. 5
http.response_time:
  min: ......................................................................... 212
  max: ......................................................................... 247
  median: ...................................................................... 219.2
  p95: ......................................................................... 219.2
  p99: ......................................................................... 219.2


All VUs finished. Total time: 31 seconds

--------------------------------
Summary report @ 21:46:55(-0600)
--------------------------------

vusers.created_by_name.0: ...................................................... 30
vusers.created.total: .......................................................... 30
vusers.failed: ................................................................. 30
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 30
http.codes.200: ................................................................ 30
http.responses: ................................................................ 30
http.response_time:
  min: ......................................................................... 212
  max: ......................................................................... 251
  median: ...................................................................... 223.7
  p95: ......................................................................... 247.2
  p99: ......................................................................... 252.2