load-testing/fork.txt
Phase started: unnamed (index: 0, duration: 30s) 21:25:29(-0600)

--------------------------------------
Metrics for period to: 21:25:40(-0600) (width: 9.259s)
--------------------------------------

vusers.created_by_name.0: ...................................................... 10
vusers.created.total: .......................................................... 10
vusers.failed: ................................................................. 10
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 10
http.codes.200: ................................................................ 10
http.responses: ................................................................ 10
http.response_time:
  min: ......................................................................... 211
  max: ......................................................................... 253
  median: ...................................................................... 232.8
  p95: ......................................................................... 252.2
  p99: ......................................................................... 252.2


Phase completed: unnamed (index: 0, duration: 30s) 21:25:59(-0600)

--------------------------------------
Metrics for period to: 21:25:50(-0600) (width: 9.245s)
--------------------------------------

vusers.created_by_name.0: ...................................................... 10
vusers.created.total: .......................................................... 10
vusers.failed: ................................................................. 10
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 10
http.codes.200: ................................................................ 10
http.responses: ................................................................ 10
http.response_time:
  min: ......................................................................... 234
  max: ......................................................................... 261
  median: ...................................................................... 242.3
  p95: ......................................................................... 252.2
  p99: ......................................................................... 252.2


--------------------------------------
Metrics for period to: 21:26:00(-0600) (width: 9.235s)
--------------------------------------

vusers.created_by_name.0: ...................................................... 10
vusers.created.total: .......................................................... 10
vusers.failed: ................................................................. 10
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 10
http.codes.200: ................................................................ 10
http.responses: ................................................................ 10
http.response_time:
  min: ......................................................................... 233
  max: ......................................................................... 250
  median: ...................................................................... 242.3
  p95: ......................................................................... 247.2
  p99: ......................................................................... 247.2


All VUs finished. Total time: 31 seconds

--------------------------------
Summary report @ 21:26:00(-0600)
--------------------------------

vusers.created_by_name.0: ...................................................... 30
vusers.created.total: .......................................................... 30
vusers.failed: ................................................................. 30
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 30
http.codes.200: ................................................................ 30
http.responses: ................................................................ 30
http.response_time:
  min: ......................................................................... 211
  max: ......................................................................... 261
  median: ...................................................................... 242.3
  p95: ......................................................................... 252.2
  p99: ......................................................................... 252.2